{
	"titolo": "Progetti a cui ho preso parte",
	"introduzione": "Ho realizzato diversi progetti universitari, e non, nel corso degli anni e in questo articolo elenco quelli che ritengo essere più importanti.<br><br><u>Progetti universitari:</u><br><br><ul><li><b>Questo sito</b><br>Ebbene si, questo sito è nato come progetto universitario per l'esame di <u>web computing</u>.<br>Questo corso mi ha permesso inoltre di imparare a programmare applicazioni lato server e a comprendere i meccanismi che stanno dietro alla gestione dei database; per esempio come avviene l'inserimento dei dati dell'utente nel database quando quest'ultimo si registra al sito e tanto altro.<br><br></li><li><b>Odd Jump (remake di doodle jump)</b><br>Ricordi il famoso videogioco doodle jump ?<br>Bene, ho creato un remake per Ios utilizzando il framework <u>libGDX</u>, che fa uso dello stesso approccio utilizzato per animare l'immagine presente nella <a href=index.html target=_blank>pagina iniziale</a> di questo sito.<br>Così facendo ho animato il titolo e le piattaforme.<br>Il videogioco è stato presentato all'esame di <u>ingegneria del software.</u><br>Dai un'occhiata al videogioco <a href=https://www.youtube.com/watch?v=-_LEqYk76c0 target=_blank>qui</a> :) .<br><br></li><li><b>Funny Blocks</b><br>Funny Blocks è un videogioco platformer che ho realizzato per l'esame di <u>interfacce grafiche e programmazione ad eventi</u>.<br>Per creare il videogioco ho utilizzato la libreria <u>java Swing.</u></li></ul><br><br><u>Progetti personali:</u><br><br><ul><li><b>Killer Bird</b><br>Tempo fa un mio amico mi chiese se fossi in grado di creare un videogioco mobile in 24 ore e Killer Bird è il risultato di quella sfida.<br>Il videogioco è stato sviluppato utilizzando il framework <u>libGDX</u> ed è disponibile sul playstore con una votazione media di <u>4,2 stelle</u>.<br>Se vuoi scaricare il videogioco sul tuo dispositivo android vai <a href=https://play.google.com/store/apps/details?id=com.iscreamkiller.android target=_blank>qui</a> oppure digita 'Killer Bird' nella barra di ricerca del playstore.<br>Ovviamente essendo il gioco stato realizzato <u>in sole 24 ore</u> puoi ben capire che la grafica e la cura nei dettagli è limitata :)<br><br></li><li><b>Red Stone</b><br>In 'Red Stone' il personaggio principale deve evitare di essere colpito in testa dalle pietre che arrivano da sinistra e da destra; se non ci riesce perderà la testa.<br>Il videogioco non è stato pubblicato sul playstore, tuttavia puoi dare un'occhiata al videogioco <a href=https://www.youtube.com/watch?v=sug_gj8jF4w target=_blank>qui</a>.<br>Anche questo videogioco è stato creato utilizzando il framework <u>libGDX</u> insieme all'estensione <u>box2D</u> per implementare la fisica.</li></ul>",
	"titoloArticolo": "",
	"testo": ""
}